{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Workshop",
    "subtitle": "",
    "icon": "https://the-m3chanic.github.io/images/favicon.ico",
    "description": "",
    "home_page_url": "https://the-m3chanic.github.io",
    "items": [
        {
            "id": "https://the-m3chanic.github.io/2024/08/25/GSoC-Final-Report/",
            "url": "https://the-m3chanic.github.io/2024/08/25/GSoC-Final-Report/",
            "title": "GSoC - Final Report",
            "date_published": "2024-08-25T11:41:29.000Z",
            "content_html": "<p><img data-src=\"/images/post_images/GSoC-Final-Report/GSoC-logo.png\" alt=\"gsoc logo\" /></p>\n<h1 id=\"gsoc-24-final-project-report\"><a class=\"anchor\" href=\"#gsoc-24-final-project-report\">#</a> GSoC '24 - Final Project Report</h1>\n<p>The following report summarises the work I have done during Google Summer of Code 2024, along with the results, scope for improvements and future work. This also serves as the final project report with all the contributions.</p>\n<table>\n<thead>\n<tr>\n<th><strong>Basic Info</strong></th>\n<th><strong>Details</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Name</strong></td>\n<td>Suraj Kumar</td>\n</tr>\n<tr>\n<td><strong>Email</strong></td>\n<td><span class=\"exturl\" data-url=\"bWFpbHRvOmhpc3VyYWprdW1hcjIwMDRAZ21haWwuY29t\">hisurajkumar2004@gmail.com</span></td>\n</tr>\n<tr>\n<td><strong>Gitlab</strong></td>\n<td><span class=\"exturl\" data-url=\"aHR0cHM6Ly9naXRsYWIucnRlbXMub3JnL3RoZS5tM2NoYW5pYw==\">the.m3chanic</span></td>\n</tr>\n<tr>\n<td><strong>LinkedIn</strong></td>\n<td><span class=\"exturl\" data-url=\"aHR0cHM6Ly93d3cubGlua2VkaW4uY29tL2luL3RoZS1tM2NoYW5pYy8=\">the-m3chanic</span></td>\n</tr>\n<tr>\n<td><strong>Twitter/X</strong></td>\n<td><span class=\"exturl\" data-url=\"aHR0cHM6Ly94LmNvbS90aGVfbTNjaGFuaWNf\">the-m3chanic</span></td>\n</tr>\n<tr>\n<td><strong>University</strong></td>\n<td><span class=\"exturl\" data-url=\"aHR0cHM6Ly93d3cuYW1yaXRhLmVkdS9jYW1wdXMvYW1yaXRhcHVyaS8=\">Amrita Vishwa Vidyapeetham, Amritapuri</span></td>\n</tr>\n<tr>\n<td><strong>Organization</strong></td>\n<td><span class=\"exturl\" data-url=\"aHR0cHM6Ly93d3cucnRlbXMub3Jn\">RTEMS Project</span></td>\n</tr>\n<tr>\n<td><strong>Project Title</strong></td>\n<td>Add Python initializer to GDB in RTEMS</td>\n</tr>\n<tr>\n<td><strong>Project Link</strong></td>\n<td><span class=\"exturl\" data-url=\"aHR0cHM6Ly9naXRsYWIucnRlbXMub3JnL3J0ZW1zLw==\">RTEMS Project Repository</span></td>\n</tr>\n<tr>\n<td><strong>Project Tracker</strong></td>\n<td><span class=\"exturl\" data-url=\"aHR0cHM6Ly9naXRsYWIucnRlbXMub3JnL2dyb3Vwcy9ydGVtcy8tL2VwaWNzLzE=\">RTEMS Project Tracker</span></td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"note-the-work-done-during-the-course-of-this-project-the-code-i-have-written-can-be-found-here\"><a class=\"anchor\" href=\"#note-the-work-done-during-the-course-of-this-project-the-code-i-have-written-can-be-found-here\">#</a> <strong>Note: The work done during the course of this Project (the code I have written), can be found <a href=\"#work-completed\">here</a></strong></h2>\n<h2 id=\"background\"><a class=\"anchor\" href=\"#background\">#</a> Background</h2>\n<p>My journey into Open Source began with a modest contribution — a documentation fix for a tool I was using. I encountered some build issues, realized that a few steps in the instructions were incorrect, and submitted a PR to correct them. It wasn’t until later that I fully grasped the impact of that contribution. Knowing that my small fix could help others avoid the same frustration gave me a sense of fulfillment.</p>\n<p>I discovered RTEMS while exploring organizations participating in GSoC 2024. As I browsed through the list of projects, one in particular caught my eye — tagged with  <code>GDB</code>  and  <code>Python</code> . Given my background in Reverse Engineering, I was immediately drawn to it and knew I wanted to make it my project. When I received my GSoC acceptance email on May 2nd, during my 2nd year in Undergrad College, I knew this summer was going to be something special. I had heard a lot about the mentor-mentee model that GSoC champions and was eager to experience it firsthand.</p>\n<h2 id=\"about-the-project\"><a class=\"anchor\" href=\"#about-the-project\">#</a> About the Project</h2>\n<p><img data-src=\"/images/post_images/GSoC-Final-Report/RTEMS-logo.png\" alt=\"rtems logo\" /></p>\n<p>RTEMS (Real-Time Executive for Multiprocessor Systems) is an open-source real-time operating system (RTOS) designed for embedded systems requiring high reliability and deterministic behavior.</p>\n<p>RTEMS provides the capability to build custom toolchains tailored to various target architectures, leveraging standard tools like GCC, Binutils, GDB and many more. These tools are essential for compiling, linking and debugging embedded applications on RTEMS.</p>\n<p>The project involved modifying the <span class=\"exturl\" data-url=\"aHR0cHM6Ly9zb3VyY2V3YXJlLm9yZy9nZGIv\">GNU Debugger (GDB)</span> to enhance its debugging capabilities within RTEMS.</p>\n<h2 id=\"problem-statement\"><a class=\"anchor\" href=\"#problem-statement\">#</a> Problem Statement</h2>\n<p>GDB includes built-in support for automatically loading Python, but this feature is limited to dynamic executables. In such cases, when a specific library is loaded by the object file in GDB, the linker triggers GDB to load the corresponding pretty-printing scripts for that library.</p>\n<p>However, RTEMS is fully statically linked, and this automatic loading does not apply to statically linked executables. Without a linker to notify GDB when a library is loaded, Python is not automatically loaded. As a result, many features that rely on Python are unavailable, leading to a significant loss in functionality during debugging.</p>\n<h2 id=\"project-goals\"><a class=\"anchor\" href=\"#project-goals\">#</a> Project Goals</h2>\n<ul>\n<li>Integrate a Python initializer into GDB for RTEMS to facilitate enhanced debugging.</li>\n<li>Enable GDB to automatically load pretty-printing scripts for RTEMS structures and libstdcxx classes.</li>\n<li>Seamlessly integrate these changes into the RTEMS toolchain, reducing the need for involvement from the user.</li>\n</ul>\n<h2 id=\"approach\"><a class=\"anchor\" href=\"#approach\">#</a> Approach</h2>\n<p>A brief summary of my approach is as follows:</p>\n<ul>\n<li><strong>Initial Exploration:</strong> I began by reviewing existing solutions employed by companies like Rust and AdaCore, which typically involve adding a wrapper over the host GDB to resolve paths for pretty-printers. To gain deeper insights, I engaged in discussions with developers from both companies as well as with GDB developers to understand the rationale behind this approach. However, I found this method unsuitable for RTEMS due to its use of a distinct toolchain for each build, separate from the host toolchain. Additionally, the wrapper approach proved to be generally inefficient for our needs.</li>\n<li><strong>Implemented Solution:</strong> I introduced a .debug_gdb_scripts section to every ELF binary. This was done by adding the section in the  <code>cpukit/sapi/src/exinit.c</code>  file, since it is linked to every application built on RTEMS. As a result, every RTEMS-built application now includes this section.</li>\n<li><strong>Python script execution:</strong> This new executable section contains a snippet of Python code that corrects paths and triggers GDB to run a script called  <code>pprinter.py</code> . This script is responsible for registering both libstdcxx and RTEMS pretty-printers.</li>\n<li><strong>Toolchain Integration:</strong> The  <code>stdcxx.py</code>  script, which registers the  <code>libstdcxx</code>  pretty-printers, needs to know the version of GCC being used since the pretty-printer scripts provided by GCC vary with versions. Therefore, the script is built alongside the toolchain to ensure compatibility.</li>\n<li><strong>RTEMS Pretty-Printer Registration:</strong> Finally, the  <code>pprinter.py</code>  script invokes a build function from rtems_pprinter.py, which registers all the RTEMS-specific pretty-printers.</li>\n</ul>\n<p>Here is a flow chart highlighting the work flow underwent for the entire project:</p>\n<p><img data-src=\"/images/post_images/GSoC-Final-Report/project-flowchart.png\" alt=\"project flow chart\" /></p>\n<p>(Note: The boxes in Blue signify changes that apply to every application being built now on, and Yellow boxes signify changes to supporting scripts and updates to the build process)</p>\n<h2 id=\"work-completed\"><a class=\"anchor\" href=\"#work-completed\">#</a> <strong>Work Completed</strong></h2>\n<p><strong>NOTE: These are the Merge Requests I made, all of which have gotten approved and merged to the upstream branch</strong></p>\n<h3 id=\"python-initializer-for-gdb\"><a class=\"anchor\" href=\"#python-initializer-for-gdb\">#</a> Python Initializer for GDB</h3>\n<ul>\n<li><a href=\"https://gitlab.rtems.org/rtems/rtos/rtems/-/merge_requests/98\"><strong>Merge Request !98 in RTOS</strong></a>: Implemented a custom section  <code>.debug_gdb_scripts</code>  in RTEMS executables for GDB to load Python scripts automatically.</li>\n<li>Developed and tested integration with the RTEMS build system to ensure Python scripts are executed upon loading an application.</li>\n</ul>\n<h3 id=\"pretty-printers-integration\"><a class=\"anchor\" href=\"#pretty-printers-integration\">#</a> Pretty-Printers Integration</h3>\n<ul>\n<li><a href=\"https://gitlab.rtems.org/rtems/tools/rtems-tools/-/merge_requests/26\"><strong>MR !26 in Tools</strong></a>: Added support for pretty-printers for RTEMS-specific data structures.</li>\n<li><a href=\"https://gitlab.rtems.org/rtems/tools/rtems-tools/-/merge_requests/26\"><strong>MR !26 in Tools</strong></a>: Created a script  <code>pprinter.py</code>  to enhance GDB's ability to display RTEMS structures in a user-friendly format.</li>\n</ul>\n<h3 id=\"integration-with-rtems-toolchain\"><a class=\"anchor\" href=\"#integration-with-rtems-toolchain\">#</a> Integration with RTEMS Toolchain</h3>\n<ul>\n<li><a href=\"https://gitlab.rtems.org/rtems/tools/rtems-source-builder/-/merge_requests/35\"><strong>MR !35 in RSB</strong></a> and <a href=\"https://gitlab.rtems.org/rtems/tools/rtems-source-builder/-/merge_requests/48\"><strong>MR !48 in RSB</strong></a>: Modified the RTEMS Source Builder (RSB) to include the necessary changes for building  <code>stdcxx.py</code>  with the latest GCC.</li>\n<li><a href=\"https://gitlab.rtems.org/rtems/docs/rtems-docs/-/merge_requests/43\"><strong>MR !43 in Docs</strong></a>: Updated documentation to reflect new features and usage instructions.</li>\n</ul>\n<h2 id=\"current-state\"><a class=\"anchor\" href=\"#current-state\">#</a> Current State</h2>\n<ul>\n<li>All major features have been implemented and tested.</li>\n<li>Python initialization and pretty-printer support have been integrated into the RTEMS build system.</li>\n<li>Pretty-printers for some basic RTEMS score structures have been written and tested.</li>\n<li>The Documentation has been updated with the changes made to GDB, and on setting up a debugging environment for embedded debugging.</li>\n</ul>\n<h2 id=\"communication-and-work-management\"><a class=\"anchor\" href=\"#communication-and-work-management\">#</a> Communication and Work Management</h2>\n<ul>\n<li>Discord was the primary platform of communication between my mentors and I, along with other members of the community.</li>\n<li>Weekly meetings to discuss Status Updates and keep everyone up to date with the project.</li>\n<li>The RTEMS Gitlab instance was used to coordinate issues, tickets, and Merge Request discussions, along with engineering discussions on Discord.</li>\n</ul>\n<h2 id=\"future-scope-for-the-project\"><a class=\"anchor\" href=\"#future-scope-for-the-project\">#</a> Future Scope for the Project</h2>\n<ul>\n<li>Add more RTEMS pretty-printer to support the feature for a larger number of Structures and Objects.</li>\n<li>Create a new class of RTEMS GDB commands (which would again, be automatically loaded and set up with no work from the User's perspective).</li>\n<li>Extending the RTEMS Documentation further to add Debugging manuals for different debuggers, and eventually add RTEMS-specific GDB commands.</li>\n</ul>\n<h2 id=\"challenges-faced-and-things-learned\"><a class=\"anchor\" href=\"#challenges-faced-and-things-learned\">#</a> Challenges Faced and Things Learned</h2>\n<h3 id=\"challenges\"><a class=\"anchor\" href=\"#challenges\">#</a> Challenges:</h3>\n<h4 id=\"integrating-python-and-gdb-with-static-linking-in-rtems\"><a class=\"anchor\" href=\"#integrating-python-and-gdb-with-static-linking-in-rtems\">#</a> Integrating Python and GDB with Static Linking in RTEMS</h4>\n<ul>\n<li>RTEMS uses static linking, which complicates GDB's ability to automatically load Python scripts, a feature that works for dynamically linked executables. This required developing a <a href=\"#approach\">custom solution</a> to ensure Python scripts could be executed within the RTEMS environment.</li>\n</ul>\n<h4 id=\"developing-a-custom-solution-for-script-loading\"><a class=\"anchor\" href=\"#developing-a-custom-solution-for-script-loading\">#</a> Developing a Custom Solution for Script Loading</h4>\n<ul>\n<li>The conventional methods for loading Python scripts in GDB did not apply to RTEMS. I had to devise a new method to introduce a  <code>.debug_gdb_scripts</code>  section in RTEMS executables.</li>\n</ul>\n<h3 id=\"things-learned\"><a class=\"anchor\" href=\"#things-learned\">#</a> Things Learned:</h3>\n<h4 id=\"adaptability-and-problem-solving\"><a class=\"anchor\" href=\"#adaptability-and-problem-solving\">#</a> Adaptability and Problem-Solving</h4>\n<ul>\n<li>I learned to adapt to unexpected challenges, such as implementing a novel solution for integrating Python into GDB for RTEMS. This required creativity and persistence, especially when initial approaches did not work.</li>\n<li>Developed a stronger ability to think outside the box and approach problems from different angles.</li>\n</ul>\n<h4 id=\"effective-communication\"><a class=\"anchor\" href=\"#effective-communication\">#</a> Effective Communication</h4>\n<ul>\n<li>Regular communication with mentors and team members was crucial. Coordinating through platforms like Discord and GitLab helped me understand the importance of clear, consistent updates and feedback.</li>\n<li>Enhanced skills in articulating ideas and progress effectively, which is vital for collaborative work.</li>\n</ul>\n<h4 id=\"time-management\"><a class=\"anchor\" href=\"#time-management\">#</a> Time Management</h4>\n<ul>\n<li>Balancing the demands of GSoC with other commitments required careful planning and prioritization. Managing a project with defined milestones and deadlines improved my time management skills.</li>\n<li>Improved ability to set realistic goals, manage deadlines, and handle multiple tasks efficiently.</li>\n</ul>\n<h4 id=\"project-ownership-and-responsibility\"><a class=\"anchor\" href=\"#project-ownership-and-responsibility\">#</a> Project Ownership and Responsibility</h4>\n<ul>\n<li>Taking ownership of the project from inception to completion underscored the importance of responsibility. Ensuring that my contributions were valuable and well-documented was a crucial aspect of this.</li>\n</ul>\n<h4 id=\"feedback-and-iteration\"><a class=\"anchor\" href=\"#feedback-and-iteration\">#</a> Feedback and Iteration</h4>\n<ul>\n<li>Receiving and acting on feedback was essential for refining my work. Iterative improvement based on input from my mentors helped me produce better results.</li>\n</ul>\n<h2 id=\"note-of-thanks\"><a class=\"anchor\" href=\"#note-of-thanks\">#</a> Note of Thanks</h2>\n<p>This project would not have seen its successful completion without the ongoing support of many people. I would specially like to thank:</p>\n<ul>\n<li><strong>Christian Mauderer</strong> and <strong>Chris Johns</strong>: For being fantastic mentors who were always ready to help me, and were patient with me (even with things I was initially clueless about). They have been with me from the very start and continue to support me.</li>\n<li><strong>Joel Sherrill</strong>, <strong>Gedare Bloom</strong> and <strong>Amar Takhar</strong>: For being awesome maintainers and helping me along the way in more ways than I can recollect - not just regarding my project but also discussions outside it.</li>\n<li>My mentors and peers at <span class=\"exturl\" data-url=\"aHR0cHM6Ly9iaTBzLmlu\">team bi0s</span> - specifically my mentor <span class=\"exturl\" data-url=\"aHR0cHM6Ly94LmNvbS9hbXVuX3JoYQ==\">AmunRha</span> - for inspiring me to try out GSoC and encouraging me throughout.</li>\n<li>My family, for their selfless support.</li>\n</ul>\n<h2 id=\"footnotes\"><a class=\"anchor\" href=\"#footnotes\">#</a> Footnotes</h2>\n<ul>\n<li><span class=\"exturl\" data-url=\"aHR0cHM6Ly9zdW1tZXJvZmNvZGUud2l0aGdvb2dsZS5jb20vcHJvZ3JhbXMvMjAyNC9wcm9qZWN0cy9adGVmUzlHTQ==\">Project Selection link</span></li>\n<li><span class=\"exturl\" data-url=\"aHR0cHM6Ly9kb2NzLmdvb2dsZS5jb20vZG9jdW1lbnQvZC8xVmVTLVFDSnY1SFVFNHBVVThqSi1PcXBZU3ZuZmZwWmNsWEY3S2JLR3FBdy9lZGl0P3VzcD1zaGFyaW5n\">Proposal</span></li>\n<li><span class=\"exturl\" data-url=\"aHR0cHM6Ly9naXRsYWIucnRlbXMub3JnL2dyb3Vwcy9ydGVtcy8tL2VwaWNzLzE=\">Project Tracker (Gitlab Epic)</span></li>\n</ul>\n",
            "tags": [
                "GSoC",
                "Google Summer of Code",
                "GDB",
                "RTEMS",
                "Embedded",
                "Debugging"
            ]
        },
        {
            "id": "https://the-m3chanic.github.io/2024/06/07/GSoC-with-RTEMS-1/",
            "url": "https://the-m3chanic.github.io/2024/06/07/GSoC-with-RTEMS-1/",
            "title": "GSoC with RTEMS! - 1/n",
            "date_published": "2024-06-06T22:00:07.000Z",
            "content_html": "<p>Extending the features of a debugger, especially GDB, sounded like a fun and interesting project at first glance. I already have quite a bit of experience working with GDB, and use it almost daily while Reverse Engineering or during CTFs.<br />\nFor those of you that are not familiar, CTF stands for &quot;Capture the Flag&quot;. It is a competition wherein the hosting team creates and puts out challenges/services that are intentionally vulnerable - usually in a way that is specific to a single field of Cyber Security - and the point of the challenge is to figure out what the vulnerability is and use it to get a text string from it called a &quot;flag&quot;. Capture more flags, gain more points. I play CTFs with <span class=\"exturl\" data-url=\"aHR0cHM6Ly9iaTBzLmlu\">team bi0s</span>.</p>\n<p>GDB has an awesome Python API that it utilizes to do things it cannot do straight out the box, and one such thing is pretty-printing.</p>\n<p>Imagine you have a weird class/structure in your program, and you want to view it in memory, so you pop it open in GDB. Then you print your variable in GDB and it spits out something so awful that you wish you never started debugging in the first place. This is because GDB obviously cannot know about any and every single structure out there, and sometimes it needs a little help - this is where the awesome Python API I mentioned comes in.</p>\n<p>Python essentially hooks onto GDB and interprets something GDB might be unable to, then do some Python magic and voila, you have the same structure neatly formatted! Some nice examples and a deeper explanation of what pretty-printing can be found in the <span class=\"exturl\" data-url=\"aHR0cHM6Ly9zb3VyY2V3YXJlLm9yZy9nZGIvY3VycmVudC9vbmxpbmVkb2NzL2dkYi5odG1sL1ByZXR0eS1QcmludGluZy5odG1sI1ByZXR0eS1QcmludGluZw==\">documentation</span></p>\n<p>GCC ships pretty-printing scripts for  <code>libstdcxx</code> , which is essentially all of the C++ STL Structures, and my job is to get the GDB installed on <span class=\"exturl\" data-url=\"aHR0cHM6Ly93d3cucnRlbXMub3Jn\">RTEMS</span> to automatically load these pretty-printing scripts at load-time, to enhance the debugging experience on RTEMS 😃. Next, add pretty-printing support for kernel structures present on RTEMS.</p>\n<p>Starting off, I already had a couple of things to get ticked off my checklist. I mainly wanted to set up a proper debugging environment, and also study various commonly used kernel structures - before diving deeper into my project. Since my project itself was to extend the functionality of the debugger, what good is it if I don't have a debugging environment setup in place?</p>\n<p>Let's jump right into my debugger setup then.</p>\n<p>I am working on a Windows 11 (x64), WSL2 (Arch) system. On top of this, I have the RTEMS tooling installed from the instructions in their <span class=\"exturl\" data-url=\"aHR0cHM6Ly9kb2NzLnJ0ZW1zLm9yZy9icmFuY2hlcy9tYXN0ZXIvdXNlci9zdGFydC9zb3VyY2VzLmh0bWw=\">documentation</span>. On top of that, they provide a variety of options to build various BSPs (think of BSPs as housing for the OS to be embedded upon). I needed a build setup such that:</p>\n<ul>\n<li>I could compile RTEMS C++ programs at will</li>\n<li>GDB could debug those programs remotely through a remote emulator (either built in, or using <span class=\"exturl\" data-url=\"aHR0cHM6Ly93d3cucWVtdS5vcmc=\">Qemu</span>)</li>\n</ul>\n<p>First, to build a BSP. I had to make 2 important choices:</p>\n<ul>\n<li>Which architecture will I use?</li>\n<li>Which BSP will I use for said architecture? (Note: A single architecture can support multiple BSPs)</li>\n</ul>\n<p>I initially thought  <code>x86_64</code>  arch, along with any suitable BSP for that arch would have me good to go, but I was sadly mistaken. Not only did I struggle to find BSPs for  <code>x86_64</code> , but I also found that there were no test configurations (yet) for any of the  <code>x86_64</code>  BSPs 😦, so I decided not to proceed with that</p>\n<p>Next up, I chose the  <code>sparc</code>  arch, along with the  <code>erc32</code>  BSP, since that was one which seemed to have very good support for emulation and GDB support, and was also the one used in most of the examples mentioned in the docs. So I went ahead and built that.</p>\n<p><code>sparc</code>  has an emulator built in in RTEMS,  <code>sparc-rtems6-sis</code>  ( <code>sis</code> : Sparc Instruction Set Simulator), which can emulate the instructions of the RTEMS executable, and GDB can attach to the process through a TCP port.</p>\n<p>However, although compiling RTEMS C++ programs and running them worked perfectly on my  <code>sparc/erc32</code>  build, I couldn't debug (i.e, step through) code conveniently. I kept hitting some kind of data access violation exception, due to which RTEMS would have a fatal crash and exit. Sad.</p>\n<p>So I finalised on the  <code>arm/xilinx_zynq_a9_qemu</code>  BSP upon the suggestion of my mentor, which worked perfectly. So, I will be using that for the rest of this blog.</p>\n<p>First, a sample C++ program.<br />\n<figure class=\"highlight cpp\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br><span class=\"line\">8</span><br><span class=\"line\">9</span><br><span class=\"line\">10</span><br><span class=\"line\">11</span><br><span class=\"line\">12</span><br><span class=\"line\">13</span><br><span class=\"line\">14</span><br><span class=\"line\">15</span><br><span class=\"line\">16</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"comment\">// main.cc </span></span><br><span class=\"line\"></span><br><span class=\"line\"><span class=\"meta\">#<span class=\"keyword\">include</span> <span class=\"string\">&lt;numeric&gt;</span></span></span><br><span class=\"line\"><span class=\"meta\">#<span class=\"keyword\">include</span> <span class=\"string\">&lt;iostream&gt;</span></span></span><br><span class=\"line\"><span class=\"meta\">#<span class=\"keyword\">include</span> <span class=\"string\">&lt;vector&gt;</span></span></span><br><span class=\"line\"></span><br><span class=\"line\"><span class=\"function\"><span class=\"type\">int</span> <span class=\"title\">main</span><span class=\"params\">()</span> </span>&#123;</span><br><span class=\"line\">    <span class=\"keyword\">auto</span> v = std::<span class=\"built_in\">vector</span>&lt;<span class=\"type\">int</span>&gt;(<span class=\"number\">5</span>);</span><br><span class=\"line\">    std::<span class=\"built_in\">iota</span>(std::<span class=\"built_in\">begin</span>(v), std::<span class=\"built_in\">end</span>(v), <span class=\"number\">0</span>);</span><br><span class=\"line\">    </span><br><span class=\"line\">    <span class=\"keyword\">for</span> (<span class=\"keyword\">auto</span> i : v) </span><br><span class=\"line\">    &#123;</span><br><span class=\"line\">        std::cout &lt;&lt; i &lt;&lt; std::endl;</span><br><span class=\"line\">    &#125;</span><br><span class=\"line\">    <span class=\"keyword\">return</span> <span class=\"number\">0</span>;</span><br><span class=\"line\">&#125;</span><br></pre></td></tr></table></figure></p>\n<p>First off, RTEMS uses  <code>waf</code>  (an alternative to  <code>make</code> ), to build BSPs and applications on the platform. It's pretty versatile and easy to understand. You need 2 main things to build any app like this on RTEMS (apart from the source, of course) -  <code>waf</code>  (the script doing all the work) &amp;  <code>wscript</code>  (the waf script containing instructions to be executed). Apart from these 2 files, you would also need some dependency files, and an initialisation script.</p>\n<p><span class=\"exturl\" data-url=\"aHR0cHM6Ly9kb2NzLnJ0ZW1zLm9yZy9icmFuY2hlcy9tYXN0ZXIvdXNlci9zdGFydC9hcHAuaHRtbA==\">This</span> page in the documentation gives a pretty good overview on how one can build an app on RTEMS.</p>\n<p>Here is my  <code>wscript</code>  for all C++ applications like the one above:<br />\n<figure class=\"highlight py\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br><span class=\"line\">8</span><br><span class=\"line\">9</span><br><span class=\"line\">10</span><br><span class=\"line\">11</span><br><span class=\"line\">12</span><br><span class=\"line\">13</span><br><span class=\"line\">14</span><br><span class=\"line\">15</span><br><span class=\"line\">16</span><br><span class=\"line\">17</span><br><span class=\"line\">18</span><br><span class=\"line\">19</span><br><span class=\"line\">20</span><br><span class=\"line\">21</span><br><span class=\"line\">22</span><br><span class=\"line\">23</span><br><span class=\"line\">24</span><br><span class=\"line\">25</span><br><span class=\"line\">26</span><br><span class=\"line\">27</span><br><span class=\"line\">28</span><br><span class=\"line\">29</span><br><span class=\"line\">30</span><br><span class=\"line\">31</span><br><span class=\"line\">32</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"><span class=\"comment\"># wscript </span></span><br><span class=\"line\"><span class=\"keyword\">from</span> __future__ <span class=\"keyword\">import</span> print_function</span><br><span class=\"line\"></span><br><span class=\"line\">rtems_version = <span class=\"string\">&quot;6&quot;</span></span><br><span class=\"line\"></span><br><span class=\"line\"><span class=\"keyword\">try</span>:</span><br><span class=\"line\">    <span class=\"keyword\">import</span> rtems_waf.rtems <span class=\"keyword\">as</span> rtems</span><br><span class=\"line\"><span class=\"keyword\">except</span>:</span><br><span class=\"line\">    <span class=\"built_in\">print</span>(<span class=\"string\">&#x27;error: no rtems_waf git submodule&#x27;</span>)</span><br><span class=\"line\">    <span class=\"keyword\">import</span> sys</span><br><span class=\"line\">    sys.exit(<span class=\"number\">1</span>)</span><br><span class=\"line\"></span><br><span class=\"line\"><span class=\"keyword\">def</span> <span class=\"title function_\">init</span>(<span class=\"params\">ctx</span>):</span><br><span class=\"line\">    rtems.init(ctx, version = rtems_version, long_commands = <span class=\"literal\">True</span>)</span><br><span class=\"line\"></span><br><span class=\"line\"><span class=\"keyword\">def</span> <span class=\"title function_\">bsp_configure</span>(<span class=\"params\">conf, arch_bsp</span>):</span><br><span class=\"line\">    <span class=\"comment\"># Add BSP specific configuration checks</span></span><br><span class=\"line\">    <span class=\"keyword\">pass</span></span><br><span class=\"line\"></span><br><span class=\"line\"><span class=\"keyword\">def</span> <span class=\"title function_\">options</span>(<span class=\"params\">opt</span>):</span><br><span class=\"line\">    rtems.options(opt)</span><br><span class=\"line\"></span><br><span class=\"line\"><span class=\"keyword\">def</span> <span class=\"title function_\">configure</span>(<span class=\"params\">conf</span>):</span><br><span class=\"line\">    rtems.configure(conf, bsp_configure = bsp_configure)</span><br><span class=\"line\"></span><br><span class=\"line\"><span class=\"keyword\">def</span> <span class=\"title function_\">build</span>(<span class=\"params\">bld</span>):</span><br><span class=\"line\">    rtems.build(bld)</span><br><span class=\"line\"></span><br><span class=\"line\">    bld(features = <span class=\"string\">&#x27;cxx cxxprogram&#x27;</span>,</span><br><span class=\"line\">        target = <span class=\"string\">&#x27;cxx_stdvec.exe&#x27;</span>,</span><br><span class=\"line\">        cxxflags = <span class=\"string\">&#x27;-std=c++11 -g -O2 -lstdc++&#x27;</span>,</span><br><span class=\"line\">        source = [<span class=\"string\">&#x27;main.cc&#x27;</span>, <span class=\"string\">&#x27;rtems_config.c&#x27;</span>])</span><br></pre></td></tr></table></figure></p>\n<p>The main function we need to focus on is  <code>build</code> . Note the  <code>features</code>  (type of program), and  <code>cxxflags</code>  parameters passed to the  <code>bld</code>  function.</p>\n<p>The application can be built with:</p>\n<p><figure class=\"highlight plaintext\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"># configure the waf for the BSP you are building for </span><br><span class=\"line\"></span><br><span class=\"line\">./waf configure --prefix=$HOME/quick-start/rtems/6 --rtems-bsps=arm/xilinx_zynq_a9_qemu</span><br></pre></td></tr></table></figure></p>\n<p><figure class=\"highlight plaintext\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"># build the app</span><br><span class=\"line\"></span><br><span class=\"line\">./waf</span><br></pre></td></tr></table></figure></p>\n<p><figure class=\"highlight plaintext\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"># run the executable to ensure it works</span><br><span class=\"line\"></span><br><span class=\"line\">rtems-run --rtems-bsps=xilinx_zynq_a9_qemu build/arm-rtems6-xilinx_zynq_a9_qemu/cxx_vectorfail.exe</span><br></pre></td></tr></table></figure></p>\n<p>Once you confirm that the app works, we can move onto debugging it.<br />\nFirst, for emulation, I went with qemu. I already had a  <code>qemu-system-arm</code>  setup so it seemed like the most logical option.</p>\n<p>Program can be emulated with:<br />\n<figure class=\"highlight plaintext\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br><span class=\"line\">8</span><br><span class=\"line\">9</span><br><span class=\"line\">10</span><br><span class=\"line\">11</span><br><span class=\"line\">12</span><br><span class=\"line\">13</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"># machine type: xilinx-zynq-a9</span><br><span class=\"line\"># -m 256: 256 megabytes of memory for emulation</span><br><span class=\"line\"># no-reboot: prevents the machine from automatically rebooting after shutdown</span><br><span class=\"line\"># -serial null: serial port output is piped to /dev/null</span><br><span class=\"line\"># -serial mon:stdio : redirects serial monitor output through stdio </span><br><span class=\"line\"># -nographic: disables graphics </span><br><span class=\"line\"># -s: enables GDB to debug </span><br><span class=\"line\"># -S: starts up Qemu in a paused state, allowing GDB time to connect before execution begins </span><br><span class=\"line\"></span><br><span class=\"line\">qemu-system-arm -M xilinx-zynq-a9 -m \\</span><br><span class=\"line\">    256M -no-reboot -serial \\</span><br><span class=\"line\">    null -serial mon:stdio -nographic \\</span><br><span class=\"line\">    -s -S</span><br></pre></td></tr></table></figure></p>\n<p>On a separate terminal, connect to this emulator (default port: 1234)</p>\n<p><figure class=\"highlight plaintext\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">arm-rtems6-gdb &lt;app_path.exe&gt;</span><br><span class=\"line\"></span><br><span class=\"line\"># inside gdb </span><br><span class=\"line\">(gdb) target extended-remote localhost:1234 </span><br><span class=\"line\">(gdb) load</span><br><span class=\"line\">...</span><br><span class=\"line\"># any gdb command you want</span><br></pre></td></tr></table></figure></p>\n<p>More information on remote debugging can be found <span class=\"exturl\" data-url=\"aHR0cHM6Ly9zb3VyY2V3YXJlLm9yZy9nZGIvY3VycmVudC9vbmxpbmVkb2NzL2dkYi5odG1sL0Nvbm5lY3RpbmcuaHRtbA==\">here</span>.</p>\n<p>Voila! Debugging environment set up!</p>\n<p>Now, this is a pretty big process, with a lot of commands. This can be made easier, of course. Shell scripting for the win.</p>\n<p><figure class=\"highlight plaintext\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br><span class=\"line\">8</span><br><span class=\"line\">9</span><br><span class=\"line\">10</span><br><span class=\"line\">11</span><br><span class=\"line\">12</span><br><span class=\"line\">13</span><br><span class=\"line\">14</span><br><span class=\"line\">15</span><br><span class=\"line\">16</span><br><span class=\"line\">17</span><br><span class=\"line\">18</span><br><span class=\"line\">19</span><br><span class=\"line\">20</span><br><span class=\"line\">21</span><br><span class=\"line\">22</span><br><span class=\"line\">23</span><br><span class=\"line\">24</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"># ./setup.sh </span><br><span class=\"line\"># initialise environment to build the application </span><br><span class=\"line\"></span><br><span class=\"line\">echo &quot;[+] Installing waf...&quot;</span><br><span class=\"line\"></span><br><span class=\"line\">curl https://waf.io/waf-2.0.19 &gt; waf</span><br><span class=\"line\">chmod +x waf</span><br><span class=\"line\"></span><br><span class=\"line\">echo &quot;[+] Initialising repository and adding dependencies...&quot;</span><br><span class=\"line\"></span><br><span class=\"line\">git init</span><br><span class=\"line\">git submodule add git://git.rtems.org/rtems_waf.git rtems_waf</span><br><span class=\"line\"></span><br><span class=\"line\">echo &quot;[+] Configuring waf...&quot;</span><br><span class=\"line\"></span><br><span class=\"line\">./waf configure --rtems=$HOME/quick-start/rtems/6 --rtems-bsp=arm/xilinx_zynq_a9_qemu</span><br><span class=\"line\"></span><br><span class=\"line\">echo &quot;[+] Building application...&quot;</span><br><span class=\"line\"></span><br><span class=\"line\">./waf</span><br><span class=\"line\"></span><br><span class=\"line\">echo &quot;[+] Running application...&quot;</span><br><span class=\"line\"></span><br><span class=\"line\">rtems-run --rtems-bsps=xilinx_zynq_a9_qemu build/arm-rtems6-xilinx_zynq_a9_qemu/cxx_vectorfail.exe</span><br></pre></td></tr></table></figure></p>\n<p>On a different terminal:<br />\n<figure class=\"highlight plaintext\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">qemu-system-arm -M xilinx-zynq-a9 -m \\</span><br><span class=\"line\">    256M -no-reboot -serial \\</span><br><span class=\"line\">    null -serial mon:stdio -nographic \\</span><br><span class=\"line\">    -s -S</span><br></pre></td></tr></table></figure></p>\n<p>Make a script called  <code>init.gdb</code> <br />\n<figure class=\"highlight plaintext\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">target extended-remote localhost:1234</span><br><span class=\"line\">load</span><br></pre></td></tr></table></figure></p>\n<p>On the first terminal, create a new shell script<br />\n<figure class=\"highlight plaintext\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br></pre></td><td class=\"code\"><pre><span class=\"line\"># ./loadgdb.sh</span><br><span class=\"line\">arm-rtems6-gdb -x init.gdb build/arm-rtems6-xilinx_zynq_a9_qemu/cxx_vectorfail.exe</span><br></pre></td></tr></table></figure></p>\n<p>I have all of these configured as commands on my terminal to make life easier, you could do that as well.</p>\n<p>In next week's blog, I will be diving straight into the main crux of my project - the issue at hand, and how I plan on fixing it, stay tuned!</p>\n",
            "tags": [
                "GSoC",
                "Google Summer of Code",
                "GDB",
                "RTEMS",
                "Embedded",
                "Debugging"
            ]
        }
    ]
}